In [2]:
import pandas as pd
import numpy as np

In [ ]:
# Head accept only one arguments
# if we want specific range of data from DF you have to use - df.iloc[1],df.iloc[1:5]
# what is the meaning of iloc - index based location

In [7]:
data = {'animal': ['dog','cat'],
       'age':[1,2],
       'visits':[np.nan,10],
        'priority':['yes','no']
       }

In [8]:
df = pd.DataFrame(data)

In [9]:
df

  animal  age  visits priority
0    dog    1     NaN      yes
1    cat    2    10.0       no

In [11]:
df.describe()

            age  visits
count  2.000000     1.0
mean   1.500000    10.0
std    0.707107     NaN
min    1.000000    10.0
25%    1.250000    10.0
50%    1.500000    10.0
75%    1.750000    10.0
max    2.000000    10.0

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    2 non-null      object
 1   age       2 non-null      int64
 2   visits    1 non-null      float64
 3   priority  2 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 192.0+ bytes

In [13]:
# IF I want to insert one more column
# The count should be matched. if the counts are not matched it through the error

In [14]:
df['location']=['trichy','chennai']

In [15]:
df

  animal  age  visits priority location
0    dog    1     NaN      yes   trichy
1    cat    2    10.0       no  chennai

In [16]:
df[['animal','age']] #It will pick specified columns  only

  animal  age
0    dog    1
1    cat    2

In [17]:
for col in df.columns:
    series = df[col]
    print(series)

0    dog
1    cat
Name: animal, dtype: object
0    1
1    2
Name: age, dtype: int64
0     NaN
1    10.0
Name: visits, dtype: float64
0    yes
1     no
Name: priority, dtype: object
0     trichy
1    chennai
Name: location, dtype: object

In [22]:
df

  animal  age  visits priority location
0    dog    1     NaN      yes   trichy
1    cat    2    10.0       no  chennai

In [24]:
# Added specified column
df.loc[12] = ['frog',1,3,'yes','ch']

In [36]:
df

   animal  age  visits priority location
0     dog    1     NaN      yes   trichy
1     cat    2    10.0       no  chennai
12   frog    1     3.0      yes       ch

In [37]:
ind = ['a','b']
df1 = pd.DataFrame(data,index=ind)

In [38]:
df1

  animal  age  visits priority
a    dog    1     NaN      yes
b    cat    2    10.0       no

In [39]:
df1.drop('b')

  animal  age  visits priority
a    dog    1     NaN      yes

In [40]:
df1

  animal  age  visits priority
a    dog    1     NaN      yes
b    cat    2    10.0       no

In [41]:
df

   animal  age  visits priority location
0     dog    1     NaN      yes   trichy
1     cat    2    10.0       no  chennai
12   frog    1     3.0      yes       ch

In [44]:
df1.loc[:,['animal','age']] #df[['animal','age']] this are the two different approches

  animal  age
a    dog    1
b    cat    2

In [47]:
df.loc[df.index[[1,2]],['animal','age']] #we use the filteration method here

   animal  age
1     cat    2
12   frog    1

In [48]:
df

   animal  age  visits priority location
0     dog    1     NaN      yes   trichy
1     cat    2    10.0       no  chennai
12   frog    1     3.0      yes       ch

In [55]:
df[df['visits']>3]
df

   animal  age  visits priority location
0     dog    1     NaN      yes   trichy
1     cat    2    10.0       no  chennai
12   frog    1     3.0      yes       ch

In [56]:
df[(df['visits']>3) & (df["animal"]=="cat")]

  animal  age  visits priority location
1    cat    2    10.0       no  chennai

In [57]:
df

   animal  age  visits priority location
0     dog    1     NaN      yes   trichy
1     cat    2    10.0       no  chennai
12   frog    1     3.0      yes       ch

In [58]:
df.groupby('animal')['age'].mean()

animal
cat     2.0
dog     1.0
frog    1.0
Name: age, dtype: float64

In [59]:
df['animal'].value_counts() #counting the animals values

dog     1
cat     1
frog    1
Name: animal, dtype: int64

In [61]:
df.sort_values(by='age', ascending=False) #sorting the values. If we want two columns use list and

   animal  age  visits priority location
1     cat    2    10.0       no  chennai
0     dog    1     NaN      yes   trichy
12   frog    1     3.0      yes       ch

In [63]:
df.sort_values(by=['visits','age'], ascending=[False, True]) #Multiple column and Multiple conditions in sort

   animal  age  visits priority location
1     cat    2    10.0       no  chennai
12   frog    1     3.0      yes       ch
0     dog    1     NaN      yes   trichy

In [64]:
df['animal'] = df['animal'].replace('cat','lion') #How to replace it

In [65]:
df

   animal  age  visits priority location
0     dog    1     NaN      yes   trichy
1    lion    2    10.0       no  chennai
12   frog    1     3.0      yes       ch

In [68]:
df['animal'] = df['animal'].map({'lion':'snake','frog':'python'})

In [69]:
df

   animal  age  visits priority location
0     NaN    1     NaN      yes   trichy
1     NaN    2    10.0       no  chennai
12    NaN    1     3.0      yes       ch

In [70]:
# map - if the value was there it replace, else it return Nan

In [71]:
# for google labs file upload
# from google.colab import files
# files.upload()

In [72]:
# Read a csv file

In [88]:
df3  = pd.read_csv(r"C:\Users\sitha\Projects\refactoring\Datascience\data\Binary predictors.csv")
df3

     Marks Admitted  Gender
0     1363       No    Male
1     1792      Yes  Female
2     1954      Yes  Female
3     1653       No    Male
4     1593       No    Male
..     ...      ...     ...
163   1722      Yes  Female
164   1750      Yes    Male
165   1555       No    Male
166   1524       No    Male
167   1461       No    Male

[168 rows x 3 columns]

In [89]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 0 to 12
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    0 non-null      object
 1   age       3 non-null      int64
 2   visits    2 non-null      float64
 3   priority  3 non-null      object
 4   location  3 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 252.0+ bytes

In [90]:
# I want to change all yes to no and all no to yes
df3['Admitted'] =  df3['Admitted'].map({'Yes':'1','No':'0'})

In [91]:
df3

     Marks Admitted  Gender
0     1363        0    Male
1     1792        1  Female
2     1954        1  Female
3     1653        0    Male
4     1593        0    Male
..     ...      ...     ...
163   1722        1  Female
164   1750        1    Male
165   1555        0    Male
166   1524        0    Male
167   1461        0    Male

[168 rows x 3 columns]